Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/supplementary_welfare_schemes/changes_to_rent_supplement.html.txt.tmx
Source language: en
Languages: ga

source: (A non-dependent household member is anyone who is not your spouse, civil partner or cohabitant who is working or getting a social welfare payment in their own right.)
ga: (Is éard is neamhchleithiúnaí muinteartha ann, duine ar bith nach do chéile, páirtnéir sibhialta nó do chomháititheoir iad atá ag oibriú nó a bhfuil íocaíocht leasa shóisialaigh á fáil acu as a gceart féin)

source: When your child/children turns 18, if they are still in full-time education, there will be no change to your Rent Supplement
ga: Nuair a bhaineann do leanbh/leanaí 18 mbliana amach, má tá siad fós in oideachas lánaimseartha, ní athrófar d’Fhorlíonadh Cíosa

source: If a child living in the household turns 18 and gets a job or a social welfare payment in their own right they are expected to pay a minimum contribution of €30
ga: Má bhaineann leanbh a chónaíonn sa teaghlach 18 mbliana amach agus má fhaigheann sé/sí post nó íocaíocht leasa shóisialaigh as a gceart féin, bítear ag súil leis go n-íocfaidh siad ranníocaíocht íosta €30

source: However, if benefit and privilege has been assessed against their social welfare payment they do not have to contribute €30
ga: Má rinneadh measúnú ar shochar agus ar phribhléid, áfach, i leith a n-íocaíochta leasa shóisialaigh, ní gá dóibh €30 a ranníoc

source: If a child leaves home your rent must be under the limit for your reduced family size
ga: Má fhágann leanbh an baile, ní mór go mbeidh do chíos faoi bhun na teorann do mhéid laghdaithe do theaghlaigh

source: (The Rent Supplement limits vary depending on where you live
ga: (Athraíonn teorainneacha an Fhorlíonta Cíosa ag brath ar cén áit a gcónaíonn tú

source: You will need to know what the limits are in your local area.)
ga: Beidh ort fios a bheith agat céard iad na teorainneacha i do cheantar áitiúil.)

source: If you have a new baby or if you adopt or foster a child your family size will increase so the rent limit that applies to your household may increase
ga: Má tá leanbh nua agat nó má uchtaíonn tú leanbh nó má dhéanann tú leanbh a altramú, tiocfaidh méadú ar mhéid do theaghlaigh, agus ar an ábhar sin, d’fhéadfadh méadú teacht ar an teorainn chíosa a bhaineann le do theaghlach

source: If you have a large family and you need larger accommodation that costs more than the rent limits that apply in your area you should discuss your situation with your local DSP representative - see ‘How to apply’ below
ga: Má tá teaghlach mór agat agus má theastaíonn breis cóiríochta uait a chosnaíonn níos mó ná na teorainneacha cíosa atá i bhfeidhm i do cheantar, ba cheart duit do chás a phlé leis an ionadaí áitiúil den RCS - féach ‘Conas iarratas a dhéanamh’ thíos

source: If you marry, enter a civil partnership or start to live with a new partner:
ga: Má phóstar thú, má iontrálann tú i bpáirtnéireacht shibhialta nó má thosaíonn tú ag cónaí le páirtnéir nua

source: If someone comes to live with you as a spouse, civil partner or cohabitant you will be treated as a couple and you will be expected to pay a minimum household contribution of €40 towards your rent
ga: Má thagann duine chun cónaí leat mar chéile, páirtnéir sibhialta nó comháititheoir, caithfear libh mar lánúin agus beifear ag súil leis go n-íocfaidh tú ranníocaíocht íosta teaghlaigh €40 i dtreo do chíosa

source: You do not have to make a new application for Rent Supplement
ga: Ní gá duit iarratas nua a dhéanamh ar Fhorlíonadh Cíosa

source: However your existing claim will be reviewed and any income your spouse, civil partner or cohabitant has from work or from a social welfare payment will be taken into account
ga: Cuirfear san áireamh aon ioncam atá ag do chéile, páirtnéir sibhialta nó comháititheoir ó obair nó ó íocaíocht leasa shóisialaigh sa tástáil mhaoine d’Fhorlíonadh Cíosa

source: If the person is working full-time you will no longer be entitled to Rent Supplement
ga: Má tá an duine sin ag oibriú go lánaimseartha, ní bheidh tú i dteideal an Forlíonadh Cíosa a fháil a thuilleadh

source: If you separate from your spouse, civil partner or cohabitant:
ga: Má scarann tú ó do chéile, páirtnéir sibhialta nó comháititheoir:

source: If your spouse or partner leaves the family home and you remain there with your children, your Rent Supplement payment does not change (because the rent limits for a one-parent family and a couple with children are the same)
ga: Má fhágann do chéile, páirtnéir sibhialta nó comháititheoir teach an teaghlaigh agus má fhanann tú ann le do chuid leanaí, ní athraítear d’íocaíocht Forlíonadh Cíosa (mar gheall gurb ionann na teorainneacha cíosa do theaghlach aontuismitheora agus lánúin)

source: However if your partner has custody of your child(ren) for most of the time, the rent limits applied for the family size can change (because the child(ren) are no longer in the home full time)
ga: Má tá caomhnóireacht do leanbh/leanaí ag do pháirtnéir do thuras mór an ama, áfach, féadtar na teorainneacha cíosa a cuireadh i bhfeidhm do mhéid an teaghlaigh athrú (mar gheall nach bhfuil an leanbh/na leanaí sa teach an t-am ar fad a thuilleadh)

source: If you do not have children and your partner leaves you will be assessed as a single person for Rent Supplement
ga: Mura bhfuil leanaí agat agus má fhágann do pháirtnéir thú, déanfar measúnú ort amhail duine singil ar mhaithe leis an bhForlíonadh Cíosa

source: If your former spouse or partner pays maintenance some of this will be assessed in the means test for Rent Supplement
ga: Má íocann d’iarchéile nó d’iarpháirtnéir cothabháil, déanfar measúnú ar roinnt di seo sa tástáil mhaoine don Fhorlíonadh Cíosa

source: The first €95.23 per week of maintenance payments is assessable in full (because it is considered to be a contribution towards your housing expenses) and any amount above this is assessed under the additional household income disregard - see ‘Additional household income disregard’ above
ga: Is féidir measúnú a dhéanamh ar an gcéad €95.23 sa tseachtain d’íocaíochtaí cothabhála ina n-iomláine (mar gheall go meastar gur ranníocaíocht iad i dtreo do chostas tithíochta) agus déantar measúnú ar aon mhéid os a chionn seo faoin neamhaird a thugtar d’ioncam breise teaghlaigh – féach ‘Neamhaird a thugtar d’ioncam breise teaghlaigh’ thuas

source: If you own your home as joint owners and the person who leaves the family home applies for Rent Supplement they may be refused because they are considered to have an interest in the home
ga: Más comhúinéirí thú féin agus do pháirtnéir ar bhur dteach agus má dhéanann an duine a fhágann an teach iarratas ar Fhorlíonadh Cíosa, d’fhéadfaí é a dhiúltú dóibh mar gheall go meastar go bhfuil leas acu sa teach

source: However, once there is a separation agreement in place and the home ownership issues have been resolved the person who left should be able to apply for Rent Supplement in their own right
ga: A luaithe a bhíonn comhaontú idirscartha i bhfeidhm agus gur réitíodh na ceisteanna úinéireachta, áfach, ba cheart go mbeadh an duine a d’fhág in ann iarratas a dhéanamh ar Fhorlíonadh Cíosa as a gceart féin

source: They will need to have their housing need assessed by the local authority in the usual way
ga: Beidh orthu measúnú a fháil ar a riachtanas tithíochta ag an údarás áitiúil ar an ngnáthbhealach

source: If your children spend some time with one parent and some time with another:
ga: Má chaitheann do leanaí roinnt ama le tuismitheoir amháin agus roinnt eile ama leis an tuismitheoir eile:

source: If you have shared custody or guardianship of a child and that child stays with you overnight for part of the week, you should check with your local Department of Social Protection representative (formerly known as the Community Welfare Officer or CWO)
ga: Má tá caomhnóireacht nó cúram comhroinnte agat ar leanbh agus má fhanann an leanbh sin leat thar oíche ar feadh cuid den tseachtain, ba cheart duit a sheiceáil leis an ionadaí áitiúil den Roinn Coimirce Sóisialaí (tugadh Oifigeach Leasa Pobail nó CWO orthu seo roimhe seo)

source: Each Rent Supplement claim is examined with regard to all of the circumstances of the case
ga: Déantar gach éileamh ar Fhorlíonadh Cíosa a scrúdú agus aird ar chúinsí uile an cháis

source: If you are not the primary carer and are looking for accommodation to provide for your children the DSP will take the following into consideration when processing your Rent Supplement claim:
ga: Murach tú féin an príomhchúramóir agus má tá cóiríocht á cuardach agat chun soláthar a dhéanamh do do leanaí, cuirfidh an RCS an méid a leanas san áireamh nuair a bhíonn d’éileamh ar Fhorlíonadh Cíosa á phróiseáil agat:

source: • Your family composition and size
ga: • Comhdhéanamh agus méid do theaghlaigh

source: • Whether any court orders or agreements exist indicating whether joint custody arrangements or access arrangements are in place
ga: • Cibé acu arb ann nó nach ann d’orduithe cúirte nó do chomhaontuithe a thugann le fios an bhfuil socruithe comhchaomhnóireachta nó socruithe rochtana i bhfeidhm

source: • Where you live in relation to the primary carer
ga: • An áit a gcónaíonn tú maidir leis an bpríomhchúramóir

source: • Whether the child is living with you temporarily as part of an access agreement
ga: • Cibé acu an bhfuil an leanbh ag cónaí leat go sealadach mar chuid de chomhaontú rochtana

source: • Any evidence of a history of continued parental support for the child such as transfer of property to the primary carer, evidence of financial support and other supports such as attending parent-teacher meetings and collecting child from school
ga: • Aon fhianaise i leith staire de thacaíocht leantach tuismitheora don leanbh, ar nós aistriú maoine chuig an bpríomhchúramóir, fianaise i leith tacaíocht airgeadais agus tacaíochtaí eile ar nós freastal ar chruinnithe tuismitheora-múinteora agus leanbh a bhailiú ón scoil

source: • Any evidence indicating whether you availed of overnight access to the child(ren) before your application for Rent Supplement
ga: • Aon fhianaise a thugann le fios an raibh nó nach raibh fáil agat ar rochtain thar oíche ar an leanbh/na leanaí sula ndearna tú d’iarratas ar Fhorlíonadh Cíosa

source: • Any evidence from any social worker or medical reports
ga: • Aon fhianaise ó aon oibrí sóisialta nó aon tuairiscí leighis

source: • Whether any letters of consent from the primary carer exist or are required
ga: • Cibé acu an ann d’aon litreacha toilithe ón bpríomhchúramóir nó an dteastaíonn siad

source: • The content of any Housing Needs Assessment from your local authority
ga: • Ábhar aon Mheasúnaithe ar Riachtanais Tithíochta ó d’údarás áitiúil

source: Other changes to your circumstances
ga: Athruithe eile ar do chúinsí

source: If your landlord raises the rent:
ga: Má ardaíonn do thiarna talún an cíos:

source: Rent Supplement is not normally paid where the rent payable to the landlord is over the limits
ga: Ní gnách go n-íoctar Forlíonadh Cíosa sa chás go bhfuil an cíos atá iníoctha leis an tiarna talún os cionn na dteorainneacha

source: However, under certain circumstances the Department's representative can pay Rent Supplement where the rent is above the relevant limit; this might apply where there are special housing needs or on a very short-term basis until the tenant is in a position to reassume responsibility for his/her rent
ga: Faoi roinnt cúinsí, áfach, féadfaidh ionadaí na Roinne Forlíonadh Cíosa a íoc sa chás go bhfuil an cíos os cionn an leibhéil ábhartha; d’fhéadfadh seo bheith i gceist sa chás gurb ann do riachtanais speisialta tithíochta nó ar bhonn an-ghearrthréimhseach go dtí go bhfuil an tionónta in ann filleadh le freagracht a ghlacadh as a c(h)íos féin

source: In some parts of Ireland rents have risen since the limits were last revised
ga: I roinnt áiteanna in Éirinn, tá méadú tagtha ar chíosanna ó rinneadh athbhreithniú ar na teorainneacha an uair dheireanach

source: The Community Welfare Service has statutory discretionary power to award or increase a Rent Supplement payment, for example, when dealing with a person who is in danger of homelessness
ga: Tá cumhacht reachtúil lánroghnach ag an bhfoireann Seirbhís Leasa Pobail chun na teorainneacha a shárú i gceantair inar tháinig méadú mór ar chíosanna agus ina bhféadfadh tionóntaí a bheith i mbaol a dteach a cheannach

source: This applies both to people getting Rent Supplement and new applicants
ga: Baineann seo le daoine a bhfuil Forlíonadh Cíosa á bhfáil acu agus iarratasóirí nua

source: Tenants in Dublin can access the Tenancy Protection Service provided by Threshold on 1800 454 454
ga: Féadfaidh tionóntaí i mBaile Átha Cliath rochtain a fháil ar an tSeirbhís um Chosaint Tionóntachta a sholáthraíonn Threshold ar 1800 454 454

source: If you have to leave your current accommodation:
ga: Más gá duit do chóiríocht reatha a fhágáil:

source: If there is a good reason why you have to leave your current accommodation (for example, your landlord is not willing to renew your lease), you can make an application for Rent Supplement for a new address, provided it is still within the rent limits
ga: Más ann d’údar maith go bhfuil ort do chóiríocht reatha a fhágáil (mar shampla, níl do thiarna talún toilteanach do léas a athnuachan), féadfaidh tú iarratas a dhéanamh ar Fhorlíonadh Cíosa do sheoladh nua, a fhad agus atá sé fós laistigh de na teorainneacha cíosa

source: However, you will have to apply again and fill out new application forms for yourself and your new landlord
ga: Beidh ort iarratas a dhéanamh arís, áfach, agus foirmeacha nua iarratais a chomhlánú duit féin agus do do thiarna talún nua

source: There may be a gap in payment while your new application is processed
ga: D’fhéadfadh bearna bheith ann san íocaíocht fad a phróiseáiltear d’iarratas nua

source: If you qualified for Rent Supplement based on housing need (that is, you are on a local authority housing list) and you are moving to a new local authority area, you will have to make a fresh application with the new local authority
ga: Má cáilíodh thú d’Fhorlíonadh Cíosa bunaithe ar riachtanas tithíochta (is é sin, go bhfuil tú ar liosta tithíochta sóisialta údaráis áitiúil) agus má tá tú ag aistriú go dtí limistéar nua údaráis áitiúil, beidh ort iarratas nua a dhéanamh leis an údarás nua áitiúil

source: Special provisions apply if you are at risk of becoming homeless
ga: Baineann forálacha speisialta má tá tú i mbaol bheith gan dídean

source: If you go to hospital or prison:
ga: Má théann tú chuig an ospidéal nó má chuirtear sa phríosún thú:

source: If you go to hospital for a short stay, or if you are in prison or remanded in custody for less than 13 weeks, you can continue to get your Rent Supplement
ga: Má théann tú chuig an ospidéal ar feadh tamall gearr, nó má chuirtear sa phríosún thú nó má athchuirtear faoi choinneáil thú ar feadh níos lú ná 13 sheachtain, féadfaidh tú leanúint ar aghaidh agus d’Fhorlíonadh Cíosa a fháil

source: If the period is longer than 13 weeks, you may no longer qualify or your family’s payment may be amended
ga: Má mhaireann an tréimhse níos faide ná 13 sheachtain, ní féidir leat cáiliú a thuilleadh nó féadtar íocaíocht do theaghlaigh a leasú

source: If you get an offer of housing from a local authority:
ga: Má fhaigheann tú tairiscint tithíochta ó údarás áitiúil:

source: If you refuse two offers of social housing from a local authority within a 12-month period, your Rent Supplement will be stopped and you will not be allowed to claim Rent Supplement for 12 months
ga: Má dhiúltaíonn tú dhá thairiscint tithíochta sóisialta ó údarás áitiúil laistigh de thréimhse 12 mhí, stopfar d’Fhorlíonadh Cíosa agus ní ligfear duit an Forlíonadh Cíosa a éileamh ar feadh 12 mhí

source: It is very important that you let the Department of Social Protection know of any changes to your circumstances including an increase in your rent
ga: Tá sé an-tábhachtach go gcuireann tú an Roinn Coimirce Sóisialaí ar an eolas faoi aon athruithe a thagann ar do chúinsí, lena n-áirítear méadú ar d'íocaíocht

source: If you wish to apply for Rent Supplement for the first time you should read our general document on Rent Supplement
ga: Más mian leat iarratas a dhéanamh ar Fhorlíonadh Cíosa den chéad uair, ba cheart duit ár gcáipéis ghinearálta ar Fhorlíonadh Cíosa a léamh

source: You can download the application form from the Department of Social Protection's website (pdf)
ga: Féadfaidh tú an fhoirm iarratais ó láithreán gréasáin na Roinne Coimirce Sóisialaí (pdf) a íoslódáil anseo

source: You should contact the Department of Social Protection's representative (formerly known as the Community Welfare Officer) at your local health centre or contact the Rent Unit for your area (see the central rent unit list)
ga: Ba cheart duit teagmháil a dhéanamh le hionadaí na Roinne Coimirce Sóisialaí (ar ar tugadh Oifigeach Leasa Pobail roimhe seo) nó ag an ionad sláinte áitiúil nó teagmháil a dhéanamh leis an Aonad Cíosa le haghaidh do cheantair (féach liosta an láraonaid chíosa)
